---
lab:
    title: '演習 11 - Microsoft Sentinel でリポジトリを使用する'
    module: 'ラーニング パス 7 - Microsoft Sentinel を使用して検出を作成し、調査を実行する'
---

# ラーニング パス 7 - ラボ 1 - 演習 11 - Microsoft Sentinel でリポジトリを使用する

## ラボのシナリオ

あなたは、Microsoft Sentinel を実装した会社で働くセキュリティ運用アナリストです。スケジュールされたルールと Microsoft セキュリティ分析ルールは既に作成されています。分析ルールを Azure DevOps リポジトリに一元化する必要があります。次に、Sentinel を Azure DevOps リポジトリに接続し、コンテンツをインポートします。


### タスク 1: 分析ルールの作成とエクスポート

このタスクでは、Microsoft Sentinel でエンティティ動作分析を有効にします。

1. 管理者として WIN1 仮想マシンにログインします。パスワードはPa55w.rd です。

2. サインイン ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供されたテナントのメール アカウントをコピーして貼り付け、「次へ」を選択します。

3. パスワードの入力ダイアログ ボックスで、ラボ ホスティング プロバイダーから提供されたテナントパスワードをコピーして貼り付け、「サインイン」を選択します。

4. Azure portal の検索バーに「Sentinel」と入力してから、「Microsoft Sentinel」を選択します。

5. Microsoft Sentinel ワークスペースを選択します。

6. 「構成」セクションの「分析」を選択します。

7. メニューから「+ 作成」ボタンをクリックし、「**スケジュール済みクエリルール**」をクリックします。

8. 分析ルールウィザードで、名前に「**Rule from Azure DevOps**」を入力します。

9.  「戦術と手法」で「**Persistence**」を選択します。

10. 「重大度」で 「**低**」を選択します。

11. **次: ルールのロジックを設定 >** ボタンをクリックします。

12. 「ルールのクエリ」に以下のKQLクエリを入力します。

    >**警告**：仮想マシンに貼り付け機能を使用すると、余分な(パイプ)文字が追加される可能性があります。必ず最初にメモ帳を使用して、次のクエリを貼り付けてください。

    ```KQL
    SecurityEvent | where EventID == 4732
    ```

13. 「**クエリ結果の表示**」を選択します。結果もエラーも表示されないはずです。エラーが発生した場合は、クエリが前の KQL ステートメントと同じように表示されることを確認してください。右上の 「X」 を選択して 「ログ」 ウィンドウを閉じ、「OK」 を選択して破棄し、変更を保存してウィザードに戻ります。


14. 下にスクロールして「クエリのスケジュール設定」を以下のように入力します。

    |設定|値|
    |---|---|
    |クエリの実行間隔|5 分|
    |次の時間分の過去のデータを参照します|1 日|

    >**ノート**：同じデータに対して意図的に多くのインシデントを生成しています。これにより、ラボでこれらのアラートを使用できるようになります。

15. 「アラートしきい値」で、アラートですべてのイベントを登録するため、値を変更しないでおきます。

16. 「イベントのグループ化」で、クエリが上記の指定されたアラートしきい値よりも多くの結果を返す限り、実行するたびに 1 つのアラートを生成するため、「すべてのイベントを単一のアラートにグループ化する」 オプションを選択したままにします。

17. 「次 : インシデント設定 >」 ボタンをクリックします。

18. 「次 : 自動応答 >」ボタンをクリックします。

19. 「次 : レビュー >」ボタンをクリックします。
 
20. 「作成」ボタンをクリックします。

21. 作成したルールをチェックして、ツールバーから「エクスポート」をクリックします。

22. 作成したルールをチェックして、右端の「・・・」を選択して「削除」をクリックします。（ワークスペースがロックされている場合は削除できません。）

### タスク 2: Azure DevOps 環境を作成する

このタスクでは、Azure DevOps リポジトリの作成と設定をテストします。

1. ブラウザで別のタブを開きます。

1. https://aexprodcus1.vsaex.visualstudio.com/me?mkt=en-US に移動します。

1. On the *We need a few more details* page, select **Continue**.

2. *詳細情報をいくつか入力する必要があります* ページで、 **続行** をクリックし「**Create new organization**」をクリックします。

3. 「Get started with Azure DevOps」でチェックし「**Continue**」をクリックします。*Almost done...* ページで、今後使用しないDEbOps組織の名前 (テナント プレフィックスなど) を入力します。ヒント：これは、ラボの 「リソース」 タブにあります (WWLx...)。

4. 表示される文字を入力してから、「**Continue**」を選択します。

5. *Create a project to get started* ページで 「Project name」に「**My Sentinel Content**」を入力し、「**Create project**」をクリックします。

6. 左ペインの **Repos** をクリックします。

7. 「Switch to the default My Sentinel Content repository」をクリックします。「*Initialize main branch with a README or gitignore*」エリアで「**Initialize**」をクリックします。.

8. このページには、リポジトリのファイルが表示されます。唯一のファイルは README.me です。

9. 「ファイル」 (ページの右側) ブレードのツール バーには、*Set up build*、*Clone*、および *:*のオプションが含まれています。: を選択すると、その他のオプションが表示されます。

10. 「:」 を選択し「**Upload Files**」をクリックします。.

11. 「**Browse**」をクリックし、「ダウンロード」ディレクトリから **Azure_Sentinel_analytic_rule.json** を選択します。

12. 「**Commit**」をクリックします。

13. ページの左上隅にある **Azure DevOps** を選択します。これにより、組織とプロジェクトが表示されます。

14. ページの左下にある「**Organization settings**」を選択します。

15. 「*Security*」エリアにある「**Policies**」を選択します。

16. 「*Application connection policies*」エリアの「*Third-party application access via OAuth*」のスイッチを「On」にします。

### タスク 3: Sentinel を Azure DevOps に接続します。

1. ブラウザーで Microsoft Sentinelを開きます。

1. Microsoft Sentinel で、「コンテンツ管理」セクションの「**リポジトリ (プレビュー)**」を選択します。

1. ツールバーから「新規追加」を選択します。

1. 名前に「**My Content**」と入力します。

2. 「ソース管理」で、「Azure DevOps」を選択します。

3. 「**承認**」をクリックします。アクセス許可要求を下にスクロールし、「**承認**」をクリックします。

4. 以前に作成した組織を選択します(例:WWLxなど)。

5. 前に作成したプロジェクトの「*My Sentinel Content*」を選択します。

6. 前に作成したリポジトリの「*My Sentinel Content*」を選択します。

7. 「ブランチ」で「**main**」を選択します。

8. すべてのコンテンツ タイプを選択します。

9. 「**作成**」をクリックします。

10. 必要に応じて Microsoft Sentinel ワークスペースに戻ります。

11. 「**リポジトリ (プレビュー)**」ページで、「最新の情報に更新」をクリックします。「前回のデプロイの状態」が「失敗」になります。  

    >ノート：「失敗」 状態は、ホストされているラボ環境の制限が原因です。通常は 「成功」 と表示されます。その後、Azure DevOps からインポートされた「**Rule from Azure DevOps**」ルールを分析で確認できます。

## これでラボは完了です。
